ObjectStorage/src/InformationRegisters/ох_ЗаданияДляОбработкиОбъектовХранилища/ох_ЗаданияДляОбработкиОбъектовХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ох_ЗаданияДляОбработкиОбъектовХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ох_ОперацииНадОбъектамиВОбъектномХранилище</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ох_СтатусыВыполненияЗаданийОбъектногоХранилища</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ох_ПрисоединенныеФайлыОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ObjectStorage/src/InformationRegisters/ох_ПрисоединенныеФайлыВХранилище/ох_ПрисоединенныеФайлыВХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ох_ПрисоединенныеФайлыВХранилище</name>
  <resources>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаДействияСсылки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСсылки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>DefinedType.ох_ПрисоединенныеФайлыОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СервисныйАккаунт</name>
    <type>
      <types>CatalogRef.ох_СервисныеАккаунтыОбъектныхХранилищ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бакет</name>
    <type>
      <types>CatalogRef.ох_БакетыОбъектныхХранилищ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ObjectStorage/src/CommonModules/ох_ОбъектноеХранилище/Module.bsl
#Область ПрограммныйИнтерфейс

#Область НастройкаХранилища

// Возвращает сервисный аккаунт по умолчанию.
//
// Возвращаемое значение:
//   СправочникСсылка.ох_СервисныеАккаунтыОбъектныхХранилищ - сервисный аккаунт по умолчанию.
//
Функция СервисныйАккаунтПоУмолчанию() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.СервисныйАккаунтПоУмолчанию();
КонецФункции

// Возвращает бакет по умолчанию.
//
// Возвращаемое значение:
//   СправочникСсылка.ох_БакетыОбъектныхХранилищ - бакет по умолчанию.
//
Функция БакетПоУмолчанию() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.БакетПоУмолчанию();
КонецФункции

// Получает настройки сервисного аккаунта.
//
// Параметры:
//  СервисныйАккаунт - СправочникСсылка.ох_СервисныеАккаунтыОбъектныхХранилищ - аккаунт для работы с хранилищем.
//
// Возвращаемое значение:
//   СервисныйАккаунт - СправочникСсылка.ох_СервисныеАккаунтыОбъектныхХранилищ - ссылка на сервисный аккаунт.
//   Сервер - Строка - адрес сервера хранилища.
//   Регион - Строка - регион сервера.
//   ЗащищенноеСоединение - Булево - флаг использования защищенного соединения.
//   ТипАутентификации - Строка - тип аутентификации на сервере хранилища.
//   Сервис - Строка - сервис api.
//   ИдентификаторКлюча - Строка - идентификатор ключа сервисного аккаунта.
//   СекретныйКлюч - Строка - ключ сервисного аккаунта.
//
Функция НастройкиСервисногоАккаунта(СервисныйАккаунт) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ох_ОбъектноеХранилищеПовтИсп.НастройкиСервисногоАккаунта(СервисныйАккаунт);
КонецФункции

// Возвращает описание переданного бакета.
//
// Параметры:
//   Бакет - СправочникСсылка.ох_БакетыОбъектныхХранилищ - для которого необходимо получить описание.
//
// Возвращаемое значение:
//   Бакет - СправочникСсылка.ох_БакетыОбъектныхХранилищ - ссылка на бакет.
//   ИмяБакета - Строка - имя бакета как оно указано в объектном хранилище.
//
Функция ДанныеБакета(Бакет) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ох_ОбъектноеХранилищеПовтИсп.ДанныеБакета(Бакет);
КонецФункции

// Возвращает признак использование интеграции в системе.
//
// Возвращаемое значение:
//  Булево - признак использования.
//
Функция ИспользоватьИнтеграцию() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.ИспользоватьИнтеграцию();
КонецФункции

// Возвращает признак того, что интеграция с объектным хранилищем реально доступна: интеграция включена
// И присутствуют все зависимости, без которых регистрация файлов невозможна (БСП, подсистема РаботаСФайлами,
// настроены собственные определяемые типы владельцев/файлов). Используется на мягком (подписочном) пути -
// см. ох_РегистрацияФайловОбъектногоХранилища.ЗарегистрироватьФайлыХранилища.
//
// Возвращаемое значение:
//  Булево - Истина, если интеграция включена и может реально работать.
//
Функция ИнтеграцияДоступна() Экспорт
	Возврат ИспользоватьИнтеграцию()
		И ох_ОбщегоНазначения.ИспользуетсяБСП()
		И ох_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами")
		И ОпределяемыеТипыФайловДоступны();
КонецФункции

// Возвращает признак того, что собственные определяемые типы ох_ (владельцы и присоединённые файлы) заполнены -
// то есть в конфигурацию подключён хотя бы один объект-владелец присоединённых файлов.
//
// Возвращаемое значение:
//  Булево - Истина, если состав определяемых типов ох_ не пуст.
//
Функция ОпределяемыеТипыФайловДоступны() Экспорт
	Возврат Метаданные.ОпределяемыеТипы.ох_ПрисоединенныеФайлыОбъектногоХранилища.Тип.Типы().Количество() > 0
		И Метаданные.ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища.Тип.Типы().Количество() > 0;
КонецФункции

// Возвращает количество дней хранения заданий в регистре.
//
// Возвращаемое значение:
//  Число - количество дней.
//
Функция КоличествоДнейХраненияЗаданий() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.КоличествоДнейХраненияЗаданий();
КонецФункции

// Возвращает количество дней хранения файлов в хранилище.
//
// Возвращаемое значение:
//  Число - количество дней.
//
Функция КоличествоДнейХраненияФайлов() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.КоличествоДнейХраненияФайлов();
КонецФункции

// Возвращает максимальное количество параллельных потоков обработки заданий.
//
// Возвращаемое значение:
//  Число - количество потоков.
//
Функция МаксимальноеКоличествоПотоковОбработкиЗаданий() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.МаксимальноеКоличествоПотоковОбработкиЗаданий();
КонецФункции

// Возвращает признак повторной обработки файлов.
//
// Возвращаемое значение:
//  Булево - признак повторной обработки.
//
Функция ОбрабатыватьОшибкиОчередиПовторно() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.ОбрабатыватьОшибкиОчередиПовторно();
КонецФункции

// Возвращает максимальное количество попыток обработки файлов.
//
// Возвращаемое значение:
//  Число - количество попыток.
//
Функция МаксимальноеКоличествоПопытокОбработкиОшибокОчереди() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.МаксимальноеКоличествоПопытокОбработкиОшибокОчереди();
КонецФункции

// Возвращает начальную задержку в секундах при обработки ошибок.
//
// Возвращаемое значение:
//  Число - задержка в секундах.
//
Функция БазоваяЗадержкаПриПовторнойОбработкиОшибокОчереди() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.БазоваяЗадержкаПриПовторнойОбработкиОшибокОчереди();
КонецФункции

// Возвращает количество заданий в одном потоке.
//
// Возвращаемое значение:
//  Число - количество заданий.
//
Функция КоличествоЗаданийВыполняемыхОднимПотоком() Экспорт
	Возврат ох_ОбъектноеХранилищеПовтИсп.КоличествоЗаданийВыполняемыхОднимПотоком();
КонецФункции

// Начальная настройка модуля.
//
// Возвращаемое значение:
//  Структура:
//   * СервисныйАккаунт - СправочникСсылка.ох_СервисныеАккаунтыОбъектныхХранилищ - сервисный аккаунт.
//   * Бакет - СправочникСсылка.ох_БакетыОбъектныхХранилищ - бакет хранилища.
//   * Сессия - Структура - см. ох_КоннекторS3.НоваяСессия
//
Функция НовыйПараметрыРаботыСОбъектнымХранилищем() Экспорт
	
	ПараметрыРаботыСОбъектнымХранилище = Новый Структура;
	
	ПараметрыРаботыСОбъектнымХранилище.Вставить("СервисныйАккаунт", СервисныйАккаунтПоУмолчанию());
	ПараметрыРаботыСОбъектнымХранилище.Вставить("Бакет"           , БакетПоУмолчанию());
	ПараметрыРаботыСОбъектнымХранилище.Вставить("Сессия");
	
	Возврат ПараметрыРаботыСОбъектнымХранилище;
	
КонецФункции

#КонецОбласти

#Область ОбслуживаниеДанныхПодсистемы

// Выполняет регламентные операции с объектами хранилища.
//
// Удаляет записи из регистра заданий исходя из количества дней хранения записей. См. ОчиститьДанныеЗаданий.
// Удаляет файлы из хранилища исходя из количества дней хранения файлов. См. УдалитьФайлыПоСрокуХранения.
// Актуализация ссылок файлов в объектном хранилище. См. ОбновитьСсылкиФайлов.
//
Процедура ВыполнитьРегламентныеОперацииОбъектногоХранилища() Экспорт
	
	ОчиститьДанныеЗаданий(КоличествоДнейХраненияЗаданий());
	
	УдалитьФайлыПоСрокуХранения(КоличествоДнейХраненияФайлов());
	ВыполнитьЗадания();
	
	ОбновитьСсылкиФайлов();
	
КонецПроцедуры

#КонецОбласти

#Область МенеджерЗаданий

// Регистрирует файлы для выгрузки в хранилище.
//
// Параметры:
//  Присоединенныефайлы - Массив из ОпределяемыеТипы.ПрисоединенныйФайл - присоединенные файлы.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем.
//  ВладелецФайлов - ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец файлов.
//
Процедура ЗарегистрироватьФайлыДляВыгрузки(
	Присоединенныефайлы, ПараметрыРаботыОбъектногоХранилища, ВладелецФайлов = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Файл Из Присоединенныефайлы Цикл
		СоздатьЗаданиеНаВыгрузку(Файл, ПараметрыРаботыОбъектногоХранилища, ВладелецФайлов);
	КонецЦикла;
	
КонецПроцедуры

// Регистрирует файлы для удаления из хранилища.
//
// Параметры:
//  Присоединенныефайлы - Массив из ОпределяемыеТипы.ПрисоединенныйФайл - присоединенные файлы.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем.
//  ВладелецФайлов - ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец файлов.
//
Процедура ЗарегистрироватьФайлыДляУдаления(
	Присоединенныефайлы, ПараметрыРаботыОбъектногоХранилища, ВладелецФайлов = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Файл Из Присоединенныефайлы Цикл
		СоздатьЗаданиеНаУдаление(Файл, ПараметрыРаботыОбъектногоХранилища, ВладелецФайлов);
	КонецЦикла;
	
КонецПроцедуры

// Регистрирует файл для выгрузки в хранилище.
//
// Параметры:
//  ПрисоединенныйФайл - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем.
//  ВладельцыФайла - Массив из ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища,
//   ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец(ы) файла, для которых
//   регистрируется задание; если Неопределено, определяется по присоединённому файлу.
//
Процедура ЗарегистрироватьФайлДляВыгрузки(
	ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, ВладельцыФайла = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ВладельцыФайла) = Тип("Массив") Тогда
		
		Для Каждого Владелец Из ВладельцыФайла Цикл
			СоздатьЗаданиеНаВыгрузку(ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, Владелец);
		КонецЦикла;
		
	Иначе
		СоздатьЗаданиеНаВыгрузку(ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, ВладельцыФайла);
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует файл для удаления из хранилища.
//
// Параметры:
//  ПрисоединенныйФайл - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем.
//  ВладельцыФайла - Массив из ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища,
//   ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец(ы) файла, для которых
//   регистрируется задание; если Неопределено, определяется по присоединённому файлу.
//
Процедура ЗарегистрироватьФайлДляУдаления(
	ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, ВладельцыФайла = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ВладельцыФайла) = Тип("Массив") Тогда
		
		Для Каждого Владелец Из ВладельцыФайла Цикл
			СоздатьЗаданиеНаУдаление(ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, Владелец);
		КонецЦикла;
		
	Иначе
		СоздатьЗаданиеНаУдаление(ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, ВладельцыФайла);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет задания из регистра ох_ЗаданияДляОбработкиОбъектовХранилища для обработки файлов хранилища.
//
Процедура ВыполнитьЗадания() Экспорт
	МенеджерЗаданий().ОбработатьЗадания();
КонецПроцедуры

// Удаляет задания исходя из срока хранения.
//
// Параметры:
//  КоличествоДнейХраненияЗаданий - Число - количество дней хранения задания, если 0, тогда задания не удаляются.
//
Процедура ОчиститьДанныеЗаданий(КоличествоДнейХраненияЗаданий) Экспорт
	
	Если ТипЗнч(КоличествоДнейХраненияЗаданий) <> Тип("Число")
		Или КоличествоДнейХраненияЗаданий < 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаданий().ОчиститьДанныеЗаданий(КоличествоДнейХраненияЗаданий);
	
КонецПроцедуры

#КонецОбласти

#Область ХранилищеФайлов

// Возвращает данные файла в объектном хранилище.
//
// Параметры:
//  ПрисоединенныйФайл - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем.
//  ВладелецФайла - ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец файла.
//
// Возвращаемое значение:
//  Неопределено - если файл не выгружен в хранилище.
//  Структура:
//   * КлючОбъекта - Строка - ключ объекта в хранилище.
//   * ДатаИзменения - Дата - последняя дата изменения файла в хранилище.
//   * ДатаНачалаДействияСсылки - Дата - дата начала действия ссылки на файл в хранилище.
//   * ДатаОкончанияДействияСсылки - Дата - дата окончания действия ссылки на файл в хранилище.
//   * Ссылка - Строка - подписанная ссылка на файл в хранилище.
//   * КонтрольнаяСумма - Строка - хеш сумма файла в хранилище,
//                       которая получается из наименования файла, расширения файла и даты модификации файла.
//
Функция ИнформацияФайлаХранилища(
	ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, ВладелецФайла = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИнформацияФайловХранилища = ИнформацияФайловХранилища(
		ох_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПрисоединенныйФайл),
		ПараметрыРаботыОбъектногоХранилища,
		ВладелецФайла);
		
	Возврат ИнформацияФайловХранилища.Получить(ПрисоединенныйФайл);
	
КонецФункции

// Возвращает данные файлов в объектном хранилище.
//
// Параметры:
//  ПрисоединенныеФайлы - Массив из ОпределяемыеТипы.ПрисоединенныйФайл - присоединенные файлы.
//  ПараметрыРаботыОбъектногоХранилища - Структура - см. НовыйПараметрыРаботыСОбъектнымХранилищем
//  ВладелецФайлов - ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища - владелец файлов.
//
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//   * Значение - Структура - см. ИнформацияФайлаХранилища.
//
Функция ИнформацияФайловХранилища(
	ПрисоединенныеФайлы, ПараметрыРаботыОбъектногоХранилища, Знач ВладелецФайлов = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПрисоединенныеФайлы.Количество()
		И Не ЗначениеЗаполнено(ВладелецФайлов) Тогда
		ВладелецФайлов = ох_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрисоединенныеФайлы[0], "ВладелецФайла");
	КонецЕсли;
	
	ОтборФайлов = Новый Структура;
	ОтборФайлов.Вставить("Файлы"           , ПрисоединенныеФайлы);
	ОтборФайлов.Вставить("ВладелецФайла"   , ВладелецФайлов);
	ОтборФайлов.Вставить("СервисныйАккаунт", ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт);
	ОтборФайлов.Вставить("Бакет"           , ПараметрыРаботыОбъектногоХранилища.Бакет);
	
	Возврат МенеджерХранилища().ИнформацияОФайлаХранилища(ОтборФайлов);
	
КонецФункции

// Выполняет обновление устаревших ссылок на файлы в хранилище.
// Ссылки обновляются за день до даты окончания срока действия.
//
Процедура ОбновитьСсылкиФайлов() Экспорт
	МенеджерХранилища().ОбновитьСсылкиФайлов();
КонецПроцедуры

// Удаляет файлы из хранилища исходя из срока хранения файлов.
//
// Параметры:
//  КоличествоДнейХраненияФайлов - Число - количество дней хранения файлов, если 0, тогда файлы не удаляются.
//                      срока хранения проверяется по дате изменения в регистре ох_ПрисоединенныеФайлыВХранилище.
Процедура УдалитьФайлыПоСрокуХранения(КоличествоДнейХраненияФайлов) Экспорт
	
	Если ТипЗнч(КоличествоДнейХраненияФайлов) <> Тип("Число")
		Или Не ЗначениеЗаполнено(КоличествоДнейХраненияФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерХранилища().УдалитьФайлыПоСрокуХранения(КоличествоДнейХраненияФайлов);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

#Область ЗагрузкаФайла

// Возвращает набор параметров для загрузки файла.
//
// Возвращаемое значение:
//  Структура:
//   * ДанныеФайла - Структура:
//    ** Ссылка - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//    ** Расширение - Строка - расширение присоединенного файла с точкой.
//    ** ВладелецФайла - ОпределяемыеТипы.ВладелецПрисоединенныхФайлов - владелец файла.
//    ** Наименование - Строка - имя файла.
//    ** ДвоичныеДанныеФайла - ДвоичныеДанные - данные файла для помещения.
//    ** ДатаМодификацииУниверсальная - Дата - дата изменения файла в системе.
//    ** ПометкаУдаления - Булево - пометка удадения файла.
//   * МетаданныеФайла - Структура - Ключ и Значение метаданных должны быть написаны на латинице,
//                                  должны соответствовать правилам, установленным для идентификаторов.
//
Функция НовыйПараметрыЗагрузкиФайла() Экспорт
	
	ДанныеФайла = НовыйДанныеПрисоединенногоФайла();
	ДанныеФайла.Вставить("ДвоичныеДанныеФайла");
	
	ПараметрыЗагрузкиФайла = Новый Структура;
	ПараметрыЗагрузкиФайла.Вставить("ДанныеФайла", ДанныеФайла);
	ПараметрыЗагрузкиФайла.Вставить("МетаданныеФайла", Новый Структура);
	
	Возврат ПараметрыЗагрузкиФайла;
	
КонецФункции

// Загружает файл в объектное хранилище.
//  Данный метод вызывает исключения: при проверки параметров и список исключений см. ох_КоннекторS3.ЗагрузитьФайл.
//
// Параметры:
//   ПараметрыРаботыОбъектногоХранилища - Структура - ох_ОбъектноеХранилище.НовыйПараметрыРаботыСОбъектнымХранилищем.
//   ПараметрыЗагрузкиФайла - Структура - см. НовыйПараметрыЗагрузкиФайла.
//
// Возвращаемое значение:
//   Структура - см. ПараметрыВыполненияОперации.
//
Функция ЗагрузитьФайл(ПараметрыРаботыОбъектногоХранилища, ПараметрыЗагрузкиФайла) Экспорт
	
	ПараметрыВыполненияОперации = ПараметрыВыполненияОперации(ПараметрыРаботыОбъектногоХранилища, ПараметрыЗагрузкиФайла);
	
	Если Не ТребуетсяВыгрузкаФайла(ПараметрыВыполненияОперации) Тогда
		Возврат ПараметрыВыполненияОперации;
	КонецЕсли;
	
	ДобавитьНаименованиеФайлаВМетаданные(ПараметрыВыполненияОперации);
	
	РезультатЗагрузки = ЗагрузитьФайлХранилища(ПараметрыВыполненияОперации);
	ЗаполнитьРезультатОперации(ПараметрыВыполненияОперации, РезультатЗагрузки);
	
	Если Не ПараметрыВыполненияОперации.РезультатОперации.Ошибка Тогда
		
		ДанныеСсылки = ПолучитьСсылкуНаФайлХранилища(ПараметрыВыполненияОперации);
		ЗаписатьДанныеФайла(ПараметрыВыполненияОперации, ДанныеСсылки);
		ПараметрыВыполненияОперации.ДанныеФайлаХранилища.Вставить("ДанныеСсылки", ДанныеСсылки);
		
	КонецЕсли;
	
	Возврат ПараметрыВыполненияОперации;
	
КонецФункции

#КонецОбласти

#Область УдалениеФайла

// Возвращает набор параметров для удаления файла.
//
// Возвращаемое значение:
//  Структура:
//   * ДанныеФайла - Структура:
//    ** Ссылка - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//    ** Расширение - Строка - расширение присоединенного файла с точкой.
//    ** ВладелецФайла - ОпределяемыеТипы.ВладелецПрисоединенныхФайлов - владелец файла.
//    ** Наименование - Строка - имя файла.
//    ** ДатаМодификацииУниверсальная - Дата - дата изменения файла в системе.
//    ** ПометкаУдаления - Булево - пометка удадения файла.
//
Функция НовыйПараметрыУдаленияФайла() Экспорт
	
	ПараметрыУдаленияФайла = Новый Структура;
	ПараметрыУдаленияФайла.Вставить("ДанныеФайла", НовыйДанныеПрисоединенногоФайла());
	
	Возврат ПараметрыУдаленияФайла;
	
КонецФункции

// Удаляет файл из объектного хранилища.
//  Данный метод вызывает исключения: при проверки параметров и список исключений см. ох_КоннекторS3.УдалитьФайл.
//
// Параметры:
//   ПараметрыРаботыОбъектногоХранилища - Структура - НовыйПараметрыРаботыСОбъектнымХранилищем.
//   ПараметрыУдаленияФайла - Структура - см. НовыйПараметрыУдаленияФайла.
//
// Возвращаемое значение:
//   Структура - см. ПараметрыВыполненияОперации.
//
Функция УдалитьФайл(ПараметрыРаботыОбъектногоХранилища, ПараметрыУдаленияФайла) Экспорт
	
	ПараметрыВыполненияОперации = ПараметрыВыполненияОперации(ПараметрыРаботыОбъектногоХранилища, ПараметрыУдаленияФайла);
	
	РезультатУдаления = УдалитьФайлХранилища(ПараметрыВыполненияОперации);
	ЗаполнитьРезультатОперации(ПараметрыВыполненияОперации, РезультатУдаления);
	
	Если Не ПараметрыВыполненияОперации.РезультатОперации.Ошибка Тогда
		УдалитьДанныеФайла(ПараметрыВыполненияОперации);
	КонецЕсли;
	
	Возврат ПараметрыВыполненияОперации;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСсылки

// Возвращает набор параметров для получения ссылки.
//
// Возвращаемое значение:
//  Структура:
//   * ДанныеФайла - Структура:
//    ** Ссылка - ОпределяемыеТипы.ПрисоединенныйФайл - присоединенный файл.
//    ** Расширение - Строка - расширение присоединенного файла с точкой.
//    ** ВладелецФайла - ОпределяемыеТипы.ВладелецПрисоединенныхФайлов - владелец файла.
//    ** Наименование - Строка - имя файла.
//    ** ДатаМодификацииУниверсальная - Дата - дата изменения файла в системе.
//    ** ПометкаУдаления - Булево - пометка удадения файла.
//
Функция НовыйПараметрыПолученияСсылки() Экспорт
	
	ПараметрыПолученияСсылки = Новый Структура;
	ПараметрыПолученияСсылки.Вставить("ДанныеФайла", НовыйДанныеПрисоединенногоФайла());
	
	Возврат ПараметрыПолученияСсылки;
	
КонецФункции

// Возвращает новую подписанную ссылку на файл в хранилище.
//  Данный метод вызывает исключения при проверки параметров.
//
// Параметры:
//   ПараметрыРаботыОбъектногоХранилища - Структура - НовыйПараметрыРаботыСОбъектнымХранилищем.
//   ПараметрыПолученияСсылки - Структура - см. НовыйПараметрыПолученияСсылки.
//
// Возвращаемое значение:
//  Структура:
//   * Ссылка - Строка - подписанная ссылка на файл в хранилище.
//   * ВремяЖизниСсылки - Число - время действия ссылки в секундах.
//   * ДатаНачалаДействия - Дата - дата начала действия ссылки.
//   * ДатаОкончанияДействия - Дата - дата окончания действия ссылки.
//
Функция ПолучитьСсылкуФайла(ПараметрыРаботыОбъектногоХранилища, ПараметрыПолученияСсылки) Экспорт
	
	ПараметрыВыполненияОперации = ПараметрыВыполненияОперации(
		ПараметрыРаботыОбъектногоХранилища, ПараметрыПолученияСсылки);
		
	Возврат ПолучитьСсылкуНаФайлХранилища(ПараметрыВыполненияОперации);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет загрузку присоединенного файла в хранилище.
//
// Параметры:
//  ПараметрыВыполненияОперации - Структура - см. ПараметрыВыполненияОперации
//
// Возвращаемое значение:
//  Структура - см. ох_КоннекторS3.ЗагрузитьФайл
//
Функция ЗагрузитьФайлХранилища(ПараметрыВыполненияОперации) Экспорт
	
	ЗагрузкаФайла = ох_КоннекторS3.НовыйПараметрыЗагрузкиФайла();
	
	ЗагрузкаФайла.Бакет           = ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища.Бакет;
	ЗагрузкаФайла.КлючОбъекта     = ПараметрыВыполненияОперации.ДанныеФайлаХранилища.КлючОбъекта;
	ЗагрузкаФайла.ДанныеФайла     = ПараметрыВыполненияОперации.ДанныеФайла.ДвоичныеДанныеФайла;
	ЗагрузкаФайла.МетаданныеФайла = ПараметрыВыполненияОперации.ДополнительныеПараметры.МетаданныеФайла;
	
	Возврат ох_КоннекторS3.ЗагрузитьФайл(ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища, ЗагрузкаФайла);
	
КонецФункции

// Возвращает данные новой ссылки на файл в хранилище.
//
// Параметры:
//  ПараметрыВыполненияОперации - Структура - см. ПараметрыВыполненияОперации
//
// Возвращаемое значение:
//  Структура - см. ох_КоннекторS3.ПолучитьСсылку
//
Функция ПолучитьСсылкуНаФайлХранилища(ПараметрыВыполненияОперации) Экспорт
	
	НаименованиеФайла = ПараметрыВыполненияОперации.ДанныеФайла.Наименование;
	РасширениеФайла   = ПараметрыВыполненияОперации.ДанныеФайла.Расширение;
	
	ПолучениеСсылки = ох_КоннекторS3.НовыйПараметрыПолученияСсылки();
	
	ПолучениеСсылки.Бакет            = ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища.Бакет;
	ПолучениеСсылки.КлючОбъекта      = ПараметрыВыполненияОперации.ДанныеФайлаХранилища.КлючОбъекта;
	ПолучениеСсылки.ВремяЖизниСсылки = ВремяЖизниСсылки();
	ПолучениеСсылки.ИмяФайла         = ИмяФайла(НаименованиеФайла, РасширениеФайла);
	ПолучениеСсылки.Расширение       = РасширениеФайла;
	
	Возврат ох_КоннекторS3.ПолучитьСсылку(
		ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища, ПолучениеСсылки);
	
КонецФункции

// Удаляет файл из хранилища.
//
// Параметры:
//  ПараметрыВыполненияОперации - Структура - см. ПараметрыВыполненияОперации
//
// Возвращаемое значение:
//  Структура - см. ох_КоннекторS3.УдалитьФайл
//
Функция УдалитьФайлХранилища(ПараметрыВыполненияОперации) Экспорт

	УдалениеФайла = ох_КоннекторS3.НовыйПараметрыУдаленияФайла();
	УдалениеФайла.Бакет           = ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища.Бакет;
	УдалениеФайла.КлючОбъекта     = ПараметрыВыполненияОперации.ДанныеФайлаХранилища.КлючОбъекта;
	
	Возврат ох_КоннекторS3.УдалитьФайл(ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища, УдалениеФайла);

КонецФункции

Функция МенеджерЗаданий() Экспорт
	Возврат РегистрыСведений.ох_ЗаданияДляОбработкиОбъектовХранилища;
КонецФункции

Функция МенеджерХранилища() Экспорт
	Возврат РегистрыСведений.ох_ПрисоединенныеФайлыВХранилище;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияПроверкаПараметров

Функция НовыйДанныеПрисоединенногоФайла()
	
	ДанныеПрисоединенногоФайла = Новый Структура;
	ДанныеПрисоединенногоФайла.Вставить("Ссылка");
	ДанныеПрисоединенногоФайла.Вставить("Расширение");
	ДанныеПрисоединенногоФайла.Вставить("ВладелецФайла");
	ДанныеПрисоединенногоФайла.Вставить("Наименование");
	ДанныеПрисоединенногоФайла.Вставить("ДатаМодификацииУниверсальная");
	ДанныеПрисоединенногоФайла.Вставить("ПометкаУдаления");
	
	Возврат ДанныеПрисоединенногоФайла;
	
КонецФункции

Функция ПараметрыВыполненияОперации(ПараметрыРаботыОбъектногоХранилища, ДанныеОперации)
	
	ЗаполнитьПараметрыРаботыОбъектногоХранилища(ПараметрыРаботыОбъектногоХранилища);
	ЗаполнитьДанныеПрисоединенногоФайла(ДанныеОперации.ДанныеФайла);
	
	ДанныеФайла = ох_ОбщегоНазначения.СкопироватьРекурсивно(ДанныеОперации.ДанныеФайла);

	ДополнительныеПараметры = Новый Структура;
	Для Каждого Параметр Из ДанныеОперации Цикл
		Если Параметр.Ключ = "ДанныеФайла" Тогда
			Продолжить;
		КонецЕсли;
		ДополнительныеПараметры.Вставить(Параметр.Ключ, ох_ОбщегоНазначения.СкопироватьРекурсивно(Параметр.Значение));
	КонецЦикла;
	
	ДанныеФайлаХранилища = Новый Структура;
	ДанныеФайлаХранилища.Вставить("КлючОбъекта", КлючОбъекта(ДанныеОперации.ДанныеФайла));
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("Ошибка"         , Ложь);
	РезультатОперации.Вставить("Результат"      , Истина);
	РезультатОперации.Вставить("СообщениеОшибки", "");
	
	ПараметрыВыполненияОперации = Новый Структура;
	ПараметрыВыполненияОперации.Вставить("ДанныеФайла"                       , ДанныеФайла);
	ПараметрыВыполненияОперации.Вставить("ДанныеФайлаХранилища"              , ДанныеФайлаХранилища);
	ПараметрыВыполненияОперации.Вставить("ДополнительныеПараметры"           , ДополнительныеПараметры);
	ПараметрыВыполненияОперации.Вставить("ПараметрыРаботыОбъектногоХранилища", ПараметрыРаботыОбъектногоХранилища);
	ПараметрыВыполненияОперации.Вставить("РезультатОперации"                 , РезультатОперации);
	
	Возврат ПараметрыВыполненияОперации;
	
КонецФункции

Процедура ЗаполнитьПараметрыРаботыОбъектногоХранилища(ПараметрыРаботыОбъектногоХранилища)
	
	ЗаполнитьНастройкиСервисногоАккаунта(ПараметрыРаботыОбъектногоХранилища);
	ЗаполнитьДанныеБакета(ПараметрыРаботыОбъектногоХранилища);
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиСервисногоАккаунта(ПараметрыРаботыОбъектногоХранилища)
	
	СервисныйАккаунт = ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт;
	Если Не ЗначениеЗаполнено(СервисныйАккаунт) Тогда
		СервисныйАккаунт = СервисныйАккаунтПоУмолчанию();
	КонецЕсли;
	
	ох_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ох_ОбъектноеХранилище.ЗаполнитьНастройкиСервисногоАккаунта",
		"СервисныйАккаунт",
		СервисныйАккаунт,
		Тип("СправочникСсылка.ох_СервисныеАккаунтыОбъектныхХранилищ"));
		
	Если Не ЗначениеЗаполнено(СервисныйАккаунт) Тогда
		ВызватьИсключение "Не заполнен сервисный аккаунт.";
	КонецЕсли;
	
	НастройкиСервисногоАккаунта = НастройкиСервисногоАккаунта(СервисныйАккаунт);
	
	Если Не НастройкиСервисногоАккаунта.Использовать Тогда
		ВызватьИсключение СтрШаблон(
			"Сервисный аккаунт %1 не используется для интеграции. Необходимо установить флаг ""Использовать"".",
			НастройкиСервисногоАккаунта.Представление);
	КонецЕсли;
	
	Эталон    = Справочники.ох_СервисныеАккаунтыОбъектныхХранилищ.НовыйНастройкиСервисногоАккаунта();
	Сообщение = "Ошибка настроек сервисного аккаунта";
	ПроверитьВходныеПараметры(НастройкиСервисногоАккаунта, Эталон, Сообщение);
	
	ПараметрыРаботыОбъектногоХранилища.Вставить("СервисныйАккаунт"           , СервисныйАккаунт);
	ПараметрыРаботыОбъектногоХранилища.Вставить("НастройкиСервисногоАккаунта", НастройкиСервисногоАккаунта);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеБакета(ПараметрыРаботыОбъектногоХранилища)
	
	Бакет = ПараметрыРаботыОбъектногоХранилища.Бакет;
	Если Не ЗначениеЗаполнено(Бакет) Тогда
		Бакет = БакетПоУмолчанию();
	КонецЕсли;
	
	ох_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ох_ОбъектноеХранилище.ЗаполнитьДанныеБакета",
		"Бакет",
		Бакет,
		Тип("СправочникСсылка.ох_БакетыОбъектныхХранилищ"));
		
	Если Не ЗначениеЗаполнено(Бакет) Тогда
		ВызватьИсключение "Не заполнен бакет хранилища.";
	КонецЕсли;
	
	ДанныеБакета = ДанныеБакета(Бакет);
	
	Эталон    = Справочники.ох_БакетыОбъектныхХранилищ.НовыйОписаниеБакета();
	Сообщение = "Некорректное описание бакета";
	ПроверитьВходныеПараметры(ДанныеБакета, Эталон, Сообщение);
	
	ПараметрыРаботыОбъектногоХранилища.Вставить("Бакет"       , Бакет);
	ПараметрыРаботыОбъектногоХранилища.Вставить("ДанныеБакета", ДанныеБакета);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПрисоединенногоФайла(ДанныеПрисоединенногоФайл)
	
	ПрисоединенныйФайл = ДанныеПрисоединенногоФайл.Ссылка;
	
	ох_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ох_ОбъектноеХранилище.ЗаполнитьДанныеПрисоединенногоФайла",
		"ПрисоединенныйФайл",
		ПрисоединенныйФайл,
		Метаданные.ОпределяемыеТипы.ох_ПрисоединенныеФайлыОбъектногоХранилища.Тип);
	
	Если Не ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
		ВызватьИсключение "Не заполнен присоединенный файл.";
	КонецЕсли;
	
	ЗаполнитьДанныеФайла(ДанныеПрисоединенногоФайл, ПрисоединенныйФайл);
	
	КонтрольнаяСумма = КонтрольнаяСуммаФайлаХранилища(ДанныеПрисоединенногоФайл);
	ДанныеПрисоединенногоФайл.Вставить("КонтрольнаяСумма", КонтрольнаяСумма);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеФайла(ДанныеПрисоединенногоФайл, ПрисоединенныйФайл)
	
	ПолучатьДанныеФайла = Ложь;
	
	СвойствоДвоичныеДанныеФайла = "ДвоичныеДанныеФайла";
	ПолучатьДвоичныеДанныеФайла = ДанныеПрисоединенногоФайл.Свойство(СвойствоДвоичныеДанныеФайла)
		И Не ЗначениеЗаполнено(ДанныеПрисоединенногоФайл[СвойствоДвоичныеДанныеФайла]);
	
	Для Каждого СвойствоФайла Из ДанныеПрисоединенногоФайл Цикл
		Если СвойствоФайла.Ключ <> СвойствоДвоичныеДанныеФайла
			И Не ЗначениеЗаполнено(СвойствоФайла.Значение) Тогда
			ПолучатьДанныеФайла = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПолучатьДанныеФайла
		И ПолучатьДвоичныеДанныеФайла Тогда
		
		ПараметрыПолученияДанныхФайлов = ох_ОбщегоНазначения.ПараметрыДанныхФайла();

		ПараметрыПолученияДанныхФайлов.ИдентификаторФормы = Новый УникальныйИдентификатор;
		ПараметрыПолученияДанныхФайлов.ВызыватьИсключение = Истина;
		ПараметрыПолученияДанныхФайлов.ПолучатьСсылкуНаДвоичныеДанные = ПолучатьДвоичныеДанныеФайла;

		ДанныеФайла = ох_ОбщегоНазначения.ДанныеФайла(ПрисоединенныйФайл, ПараметрыПолученияДанныхФайлов);
		ох_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеПрисоединенногоФайл, ДанныеФайла, "ЗаменятьПустые");
		
		Если ДанныеПрисоединенногоФайл.Свойство("ВладелецФайла")
			И Не ЗначениеЗаполнено(ДанныеПрисоединенногоФайл.ВладелецФайла) Тогда
			ДанныеПрисоединенногоФайл.ВладелецФайла = ДанныеФайла.Владелец;
		КонецЕсли;
		
		Если ПолучатьДвоичныеДанныеФайла Тогда
			ДанныеПрисоединенногоФайл.ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(
				ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		КонецЕсли;
		
	ИначеЕсли ПолучатьДанныеФайла Тогда
		
		Свойства    = ох_ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ДанныеПрисоединенногоФайл);
		ДанныеФайла = ох_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрисоединенныйФайл, Свойства);
		ох_ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеПрисоединенногоФайл, ДанныеФайла, "ЗаменятьПустые");
		
	ИначеЕсли ПолучатьДвоичныеДанныеФайла Тогда
		
		ДанныеПрисоединенногоФайл.ДвоичныеДанныеФайла = ох_ОбщегоНазначения.ДвоичныеДанныеФайла(ПрисоединенныйФайл);

	Иначе
		// Ни данные файла, ни двоичные данные не запрошены - ничего не получаем.
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВходныеПараметры(Знач ВходныеПараметры, Эталон, Сообщение)
	
	СообщенияОбОшибках = Новый Массив;
	
	ПроверитьВходныеПараметрыРекурсивно(ВходныеПараметры, Эталон, Сообщение, СообщенияОбОшибках);
	
	Если СообщенияОбОшибках.Количество() Тогда
		
		РазделительСообщений = Символы.ПС + Символы.Таб;
		
		ВызватьИсключение СтрШаблон(
			"%1:%2%3",
			Сообщение,
			РазделительСообщений,
			СтрСоединить(СообщенияОбОшибках, РазделительСообщений));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВходныеПараметрыРекурсивно(Знач ВходныеПараметры, Эталон, Сообщение, СообщенияОбОшибках)
	
	Для Каждого Параметр Из Эталон Цикл
		
		Имя          = Параметр.Ключ;
		Значение     = Параметр.Значение;
		ТипПараметра = ТипЗнч(Значение);
		
		Если Не ВходныеПараметры.Свойство(Имя) Тогда
			ТекстСообщения = СтрШаблон("Не указан обязательный параметр %1", Имя);
		ИначеЕсли ТипЗнч(ВходныеПараметры[Имя]) <> ТипПараметра Тогда
			ТекстСообщения = СтрШаблон("Тип параметры %1 не соответствует ожидаемому типу %2", Имя, Строка(ТипПараметра));
		ИначеЕсли ТипПараметра <> Тип("Булево")
			И Не ЗначениеЗаполнено(ВходныеПараметры[Имя]) Тогда
			ТекстСообщения = СтрШаблон("Не заполнен обязательный параметр %1", Имя);
		ИначеЕсли ТипПараметра = Тип("Структура") Тогда
			ПроверитьВходныеПараметрыРекурсивно(ВходныеПараметры[Имя], Значение, Сообщение, СообщенияОбОшибках);
			Продолжить;
		Иначе
			Продолжить;
		КонецЕсли;
		
		СообщенияОбОшибках.Добавить(ТекстСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

Функция КонтрольнаяСуммаФайлаХранилища(ДанныеФайла)
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	
	Хеш.Добавить(ДанныеФайла.Наименование);
	Хеш.Добавить(ДанныеФайла.Расширение);
	Хеш.Добавить(XMLСтрока(ДанныеФайла.ДатаМодификацииУниверсальная));
	
	Возврат ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
	
КонецФункции

#КонецОбласти

#Область РаботаСКоннектором

Процедура ДобавитьНаименованиеФайлаВМетаданные(ПараметрыВыполненияОперации)
	
	НаименованиеФайла = ПараметрыВыполненияОперации.ДанныеФайла.Наименование;
	РасширениеФайла   = ПараметрыВыполненияОперации.ДанныеФайла.Расширение;
	
	ИмяФайла = ИмяФайла(НаименованиеФайла, РасширениеФайла);
	
	ПараметрыВыполненияОперации.ДополнительныеПараметры.МетаданныеФайла.Вставить("name", ИмяФайла);
	
КонецПроцедуры

Функция КлючОбъекта(ДанныеФайла)
	
	ПолноеИмяБезРасширения = СтрШаблон(
		"1C/%1/%2",
		XMLСтрока(ДанныеФайла.ВладелецФайла),
		XMLСтрока(ДанныеФайла.Ссылка));
	
	КлючОбъекта = ох_ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(ПолноеИмяБезРасширения, ДанныеФайла.Расширение);
	
	Возврат КлючОбъекта;
	
КонецФункции

Процедура ЗаполнитьРезультатОперации(ПараметрыВыполненияОперации, ОтветКоннектора)
	
	Сообщения = Новый Массив;
	Сообщения.Добавить(ОтветКоннектора.КодСостояния);
	Сообщения.Добавить(ОтветКоннектора.URL);
	Сообщения.Добавить(ОтветКоннектора.КлассификацияОшибки);
	Сообщения.Добавить(ОтветКоннектора.Сообщение);
	
	ТекстОшибки = СтрСоединить(Сообщения, Символы.ПС);
	
	ПараметрыВыполненияОперации.РезультатОперации.Ошибка          = ОтветКоннектора.Ошибка;
	ПараметрыВыполненияОперации.РезультатОперации.Результат       = ОтветКоннектора.Результат;
	ПараметрыВыполненияОперации.РезультатОперации.СообщениеОшибки = ТекстОшибки;
	
КонецПроцедуры

#КонецОбласти

#Область ПрисоединенныеФайлыХранилища

Процедура ЗаписатьДанныеФайла(ДанныеПомещенногоФайла, ДанныеСсылки = Неопределено)
	МенеджерХранилища().ЗаписатьФайлХранилища(ЗаписьФайлаХранилища(ДанныеПомещенногоФайла, ДанныеСсылки));
КонецПроцедуры

Процедура УдалитьДанныеФайла(ДанныеУдаленногоФайла)
	МенеджерХранилища().УдалитьФайлХранилища(ЗаписьФайлаХранилища(ДанныеУдаленногоФайла));
КонецПроцедуры

Функция ЗаписьФайлаХранилища(ДанныеПомещенногоФайла, ДанныеСсылки = Неопределено)
	
	ЗаписьФайлаХранилища = МенеджерХранилища().НовыйДанныеФайлаХранилища();
	
	ЗаписьФайлаХранилища.Файл             = ДанныеПомещенногоФайла.ДанныеФайла.Ссылка;
	ЗаписьФайлаХранилища.ВладелецФайла    = ДанныеПомещенногоФайла.ДанныеФайла.ВладелецФайла;
	ЗаписьФайлаХранилища.СервисныйАккаунт = ДанныеПомещенногоФайла.ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт;
	ЗаписьФайлаХранилища.Бакет            = ДанныеПомещенногоФайла.ПараметрыРаботыОбъектногоХранилища.Бакет;
	ЗаписьФайлаХранилища.КлючОбъекта      = ДанныеПомещенногоФайла.ДанныеФайлаХранилища.КлючОбъекта;
	ЗаписьФайлаХранилища.КонтрольнаяСумма = ДанныеПомещенногоФайла.ДанныеФайла.КонтрольнаяСумма;
	
	Если ДанныеСсылки <> Неопределено Тогда
		ЗаписьФайлаХранилища.СсылкаФайлаХранилища.ДатаНачалаДействияСсылки    = ДанныеСсылки.ДатаНачалаДействия;
		ЗаписьФайлаХранилища.СсылкаФайлаХранилища.ДатаОкончанияДействияСсылки = ДанныеСсылки.ДатаОкончанияДействия;
		ЗаписьФайлаХранилища.СсылкаФайлаХранилища.Ссылка                      = ДанныеСсылки.Ссылка;
	КонецЕсли;
	
	Возврат ЗаписьФайлаХранилища;
	
КонецФункции

Функция ТребуетсяВыгрузкаФайла(ПараметрыВыполненияОперации)
	
	ДанныеФайла = ПараметрыВыполненияОперации.ДанныеФайла;
	ПараметрыРаботыОбъектногоХранилища = ПараметрыВыполненияОперации.ПараметрыРаботыОбъектногоХранилища;
	
	ДанныеФайлаХранилища = ИнформацияФайлаХранилища(
		ДанныеФайла.Ссылка, ПараметрыРаботыОбъектногоХранилища, ДанныеФайла.ВладелецФайла);
	
	Возврат ДанныеФайлаХранилища = Неопределено
		Или ДанныеФайлаХранилища.КонтрольнаяСумма <> ДанныеФайла.КонтрольнаяСумма;
	
КонецФункции

Функция ВремяЖизниСсылки(КоличествоДней = 7) Экспорт
	Возврат КоличествоДней * 86400;
КонецФункции

#КонецОбласти

#Область ЗаданияДляОбработкиФайловХранилища

Процедура СоздатьЗаданиеНаВыгрузку(
	ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, Знач ВладелецФайла = Неопределено)
	
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		ВладелецФайла = ох_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрисоединенныйФайл, "ВладелецФайла");
	КонецЕсли;
	
	Если Не РегистрироватьФайл(ВладелецФайла) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаданий().СоздатьЗаданиеНаВыгрузкуФайла(
		ПараметрыРегистрацииФайлаДляОбработки(ПрисоединенныйФайл, ВладелецФайла, ПараметрыРаботыОбъектногоХранилища));
	
КонецПроцедуры

Процедура СоздатьЗаданиеНаУдаление(
	ПрисоединенныйФайл, ПараметрыРаботыОбъектногоХранилища, Знач ВладелецФайла = Неопределено)
	
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		ВладелецФайла = ох_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрисоединенныйФайл, "ВладелецФайла");
	КонецЕсли;
	
	Если Не РегистрироватьФайл(ВладелецФайла) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаданий().СоздатьЗаданиеНаУдалениеФайла(
		ПараметрыРегистрацииФайлаДляОбработки(ПрисоединенныйФайл, ВладелецФайла, ПараметрыРаботыОбъектногоХранилища));
	
КонецПроцедуры

Функция ПараметрыРегистрацииФайлаДляОбработки(ПрисоединенныйФайл, ВладелецФайла, ПараметрыРаботыОбъектногоХранилища)
	
	ПараметрыРегистрации = МенеджерЗаданий().НовыйПараметрыСозданияЗаданияДляОбработкиФайла();
	
	ПараметрыРегистрации.Файл             = ПрисоединенныйФайл;
	ПараметрыРегистрации.ВладелецФайла    = ВладелецФайла;
	ПараметрыРегистрации.СервисныйАккаунт = ПараметрыРаботыОбъектногоХранилища.СервисныйАккаунт;
	ПараметрыРегистрации.Бакет            = ПараметрыРаботыОбъектногоХранилища.Бакет;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция РегистрироватьФайл(ВладелецФайла)
	
	Если ЗначениеЗаполнено(ВладелецФайла) Тогда
		
		ОпределяемыйТипВладельцев = Метаданные.ОпределяемыеТипы.ох_ВладелецПрисоединенныхФайловОбъектногоХранилища;
		
		Если Не ОпределяемыйТипВладельцев.Тип.СодержитТип(ТипЗнч(ВладелецФайла)) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

Функция ИмяФайла(Наименование, Расширение)
	
	ЧастиНаименования = ох_ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Наименование);
	ИмяФайла = ох_ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(ЧастиНаименования.ИмяБезРасширения, Расширение);
	
	Возврат ИмяФайла;
	
КонецФункции

#КонецОбласти
